###############################
#  Taps                       #
###############################

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "johanhaleby/kubetail"

cask_args appdir: "/Applications"

###############################
#  Command line               #
###############################

brew "zsh"
brew "bash"
cask "kitty"

###############################
#  Power comand line          #
###############################

brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "midnight-commander"
brew "lsd"
brew "grc"
brew "bat"
brew "lnav"

###############################
# GNU utilities               #
###############################

brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnutls"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-indent"
brew "gnu-which"
brew "gcc"
brew "grep"
brew "openssh"
brew "tree"

###############################
#  Git                        #
###############################

brew "git"
brew "github-keygen"
brew "git-quick-stats"
brew "diff-so-fancy"

###############################
#  Crypto                     #
###############################

cask "tor-browser"
brew "gnupg"
cask "gpg-suite"

###############################
#  Cloud                      #
###############################

brew "awscli"
brew "aws-shell"
brew "azure-cli"
cask "docker"
brew "lazydocker"
brew "ctop"

###############################
#  Kubernetes                 #
###############################

brew "kubernetes-cli"
brew "kubectx"
brew "kubetail"
brew "k9s"
brew "minikube"
brew "helm"

###############################
#  Languages                  #
###############################

cask "dotnet-sdk"
brew "python3"
brew "ruby"
brew "ruby-build"

###############################
#  Databases                  #
###############################

# brew "postgresql"
# brew "sqlite"
# brew "mariadb"
# cask "robo-3t"

###############################
#  Task monitor               #
###############################

brew "htop"
brew "bpytop"
brew "ncdu"

###############################
#  Networking                 #
###############################

brew "httpie"
brew "mkcert"
brew "mtr"
brew "k6"
cask "postman"
cask "nordvpn"
cask "microsoft-remote-desktop"
cask "vnc-viewer"

###############################
# Command line utilities      #
###############################

brew "mas"
brew "dockutil"
brew "thefuck"
brew "fpp"

###############################
#  IDEs                       #
###############################

cask "jetbrains-toolbox"
cask "visual-studio-code"
brew "micro"

###############################
#  System utilities           #
###############################

cask "alt-tab"
cask "rectangle"
cask "raycast"
cask "hyperkey"
cask "bitwarden"
cask "the-unarchiver"

###############################
#  BROWSING                   #
###############################

cask "microsoft-edge"
cask "onedrive"
cask "transmission"

###############################
#  Media                      #
###############################

cask "vlc"
cask "spotify"
cask "pocket-casts"
cask "adobe-acrobat-reader"
cask "obs"
cask "qnapi"

###############################
#  Drivers                    #
###############################

cask "linearmouse"
cask "logitech-options"

###############################
#  Communication              #
###############################

cask "whatsapp"
cask "messenger"
cask "slack"
cask "discord"

###############################
#  Fonts                      #
###############################

# Monospace
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
cask "homebrew/cask-fonts/font-meslo-lg-nerd-font"
cask "homebrew/cask-fonts/font-fira-code-nerd-font"
cask "homebrew/cask-fonts/font-hasklig"

# Sans/Serif
cask "homebrew/cask-fonts/font-comic-neue"
cask "homebrew/cask-fonts/font-inter"

###############################
#  APP STORE                  #
###############################

mas "Microsoft OneNote", id: 784801555
mas "Dropover", id: 1355679052
mas "Tailscale", id: 1475387142  
mas "Disk Speed Test", id: 425264550
mas "Folder Hub - File browser", id: 2116915533